import { createSlice } from '@reduxjs/toolkit'
import { Product } from '../../types' // Імпортуємо тип Product

interface ProductsState {
	items: Product[]
}

const initialState: ProductsState = {
	items: [
		{
			id: 1,
			title: 'Насос шприцевий М500',
			price: 46535,
			category: 'Хірургія',
			image: '/images/products/m500.jpg',
			description: `Екран: Шприцевий насос M500 оснащений великим 6,2-дюймовим кольоровим, сенсорним дисплеєм із можливістю регулювання кута нахилу екрану  від 0 до 45 градусів забезпечує зручність налаштувань та комфортну візуалізацію процесу інфузії.
			Двоканальна система: Двоканальна конструкція шприцевого насосу забезпечує не тільки режим одночасного введення двох різних лікарських препаратів з індивідуальними параметрами інфузії, а й режим каскадного введення одного і того ж лікарського препарату, який може забезпечити безперервну разову інфузію об’ємом до 120 мл.
			Режими інфузії: режим швидкості, режим часу, режим маси, режим інтервалу, режим TIVA, режим 1-ї дози, послідовний режим, мікро режим, режим Ramp, режим каскадної інфузії забезпечують готовність до інфузії в різноманітних клінічних ситуаціях.
			Самовизначення шприца: функція автоматичного визначення об’єму встановленого шприца (5 мл, 10 мл, 20 мл,30 мл, 50 або 60 мл).
			Бібліотека лікарських препаратів: нараховує 2100 лікарських препаратів, які розділено по типам, це дозволяє швидко вибирати потрібний препарат. Можливість редагування назв, додавання та видалення користувальницьких препаратів, присвоєння лікарському препарату відповідного типу забезпечує зручність в процесі експлуатації.
			Безперервне титрування: можливість редагування заданих параметрів в процесі інфузії без зупинки процесу введення лікарського препарату дозволяє медперсоналу швидко реагувати на клінічні зміни та налаштовувати параметри згідно потреб.
			Анти-болюс: функція автоматичного скидання тиску та моніторинг тиску в реальному часі. У разі виникнення оклюзії тиск в інфузійних трубках автоматично скидається та подається звуковий і візуальний сигнали тривоги, щоб медичний персонал звернув увагу і прийняв міри.
			Динамічний моніторинг тиску: сигналізація тривоги в режимі реального часу при виникненні аномального тиску, спеціально розроблена у відповідь на різкі зміни тиску в шприці. Величина тиску в шприці відстежується як за допомогою цифрового, так і та графічного дисплеїв.
			Багатопроцесорний моніторинг: конструкцією передбачено шість процесорів для моніторингу один одного та формування скоординованої системи сигналізації тривог, щоб забезпечити безпеку ін’єкції та запобігти нещасним випадкам.
			Високоточна ін'єкція: високопродуктивний кроковий двигун та система трансмісії забезпечують стабільну швидкість (без коливань) введення препарату з високою точністю і ефективністю, навіть на найнижчих значеннях швидкості інфузії.
			Мова інтерфейсного меню: українська, англійська російська.
			Пам'ять: журнал історії містить системні дані та дані виконаних інфузій, в пам’яті приладу може зберігатися 2000 записів.
			Графічні тренди: дані про динаміку змін за останні 12 годин
			Автономність роботи: за умови повністю зарядженого акумулятора та мінімальної яскравості насос може працювати на швидкості 5 мл/год не менше 5 годин. Насос може працювати за максимальної доступної для вибору швидкості з новою та повністю зарядженою батареєю протягом 1.5  години.
			Невідкладна медична допомога: можливість використання стаціонарно закріпленого М500 в машині швидкої допомоги під час транспортування пацієнтів.
			Ергономічний дизайн, компактні розміри, незначна вага, зручна ручка для перенесення забезпечують зручність в процесі експлуатації.
			Інше: самотестування при ввімкненні, режим очікування, функція виклику медсестри, нічний режим, дротове підключення до центральної станції моніторингу, підсвічування кнопок управління, функція план лікування для швидкого запуску інфузії з попередньо збереженими параметрами інфузії. Стандартна комплектація містить кронштейн для кріплення насоса.`,
			features: `Параметр: Двоканальний дисплей  
			Значення: 6.2-дюймовий, кольоровий, сенсорний, 800×480  
			Тип: Дисплей  
			
			Параметр: Шприци  
			Значення: 5мл, 10мл, 20мл, 30мл, 50мл, 60мл різних виробників  
			Тип: Шприц  
			
			Параметр: Режими інфузії  
			Значення: Режим швидкості, Режим часу, Режим маси, Режим інтервалу, Режим TIVA, Режим 1-ї дози, Послідовний режим, Мікро режим, Режим Ramp, Режим каскадної інфузії  
			Тип: Режими інфузії  
			
			Параметр: Діапазон налаштування швидкості  
			Значення: 0,10 мл/год~2200,00 мл/год;  
			Шприц 50/60 мл: 0,10-2200,00 мл/год;  
			Шприц 30 мл: 0,10-1200,00 мл/год;  
			Шприц 20 мл: 0,10-600,00 мл/год;  
			Шприц 10 мл: 0,10-300,00 мл/год;  
			Шприц 5 мл: 0,10-100,00 мл/год;  
			Тип: Діапазон налаштування швидкості  
			Параметр: Одиниці виміру швидкості  
			Значення: мл/год, г/год, мг/год, мкг/год, нг/год, г/кг/год, мг/кг/год, мкг/кг/год, нг/кг/год, г/кг/хв, мг/кг/хв, мкг/кг/хв, нг/кг/хв, ОД./кг/хв, ОД./кг/год, КО/кг/хв, КО/кг/год, МО/кг/хв, МО/кг/год  
			Тип: Одиниці виміру швидкості  
			Параметр: Діапазон налаштування дози  
			Значення: 0.000~999.999 (препарат), мінімальний крок налаштування 0.001  
			0.000~999.999 мл (рідина), мінімальний крок налаштування 0.01  
			Тип: Діапазон налаштування дози  
			Параметр: Одиниці маси дози  
			Значення: г, мг, мкг, нг, ОД, МО, KО  
			Тип: Одиниці маси дози  
			Параметр: Діапазон налаштування часу  
			Значення: 00:00:01～99:59:59 год:хв:с  
			Тип: Діапазон налаштування часу  
			Параметр: Діапазон налаштування об’єму VTBI  
			Значення: 0,10-9999,99 мл, 0 - вимк.  
			Мінімальний крок налаштування 0,01 мл  
			Тип: Діапазон налаштування об’єму VTBI  
			Параметр: Послідовний режим  
			Значення: Можна налаштувати до 10 послідовностей інфузії`,
		},
		{
			id: 2,
			title: 'Мікроскоп операційний офтальмологічний YZ20Р5',
			price: 243950,
			category: 'Хірургія',
			image: './images/products/yz20P5.jpg',
			description: `Операційний мікроскоп YZ20Р5
			(для проведення офтальмологічних втручань)
			Операційний пересувний мікроскоп YZ20P5 має невелику вагу, малі габарити, що робить його надзвичайно зручним. Він задовольняє всім вимогам загальної офтальмологічної мікрохірургії.
			Мікроскоп забезпечує стереоскопічний ефект, має три ступенями збільшення. В системі освітлення використовується джерело світла, яке є повністю безпечним для людського ока. Завдяки використанню високоякісних галогенних ламп, досягається яскраве і рівномірне освітлення.
			У кронштейнах використовується пружинна балансувальна система, яка дає можливість переміщувати мікроскоп у вертикальній площині і зупиняти його в потрібному положенні. Передбачена можливість точного фокусування. У мікроскопі можуть регулюватися такі параметри, як збільшення, фокусування, нахил, при цьому фокусування може регулюватися за допомогою педалі.
			Особливості:
			- Пересувний, з трьома ступенями збільшення;
			- Пружинний балансувальний пристрій в кронштейні забезпечує вільне переміщення мікроскопа;
			- Все лінзи мають багатошарове покриття, захищені від цвілі.`,
			features: `Збільшення окуляра: 12,5X/16B
			Регульована оптична сила лінз в діоптріях: ±5D
			Нахил бінокулярного тубусу: 45°
			Діапазон регуляції міжзіничної відстані: 50 мм - 70 мм
			Джерело освітлення: Галогенна лампа 12 В / 100 Вт
			Тип освітлення: 6° +0° коаксиальне освітлення
			Коаксиалье освітлення: > 20000 люкс
			Максимальна довжина розкладеного кронштейна: 870 мм
			Регульований діапазон переміщення по вертикалі: 700 мм - 1100 мм
			Діапазон точного регулювання: 30 мм
			Параметри живлення: ~220 В /50 Гц
			Потужність: 120 ВА
			Запобіжник: ~250 В T 1,25 A
			Стандарт електричної безпеки: Стандарт IEC601-1
			Вага брутто, кг: 41
			Вага нетто, кг: 35
			Загальний обсяг упаковки: 0,2 м3
			Кількість коробок: 1
			Об'єктив / Робоча відстань:
			- Збільшення: 5,3х
				- Діаметр поля спостереження: F200/190 (38 мм)
			- Збільшення: 8х
				- Діаметр поля спостереження: F200/190 (25 мм)
			- Збільшення: 12х
				- Діаметр поля спостереження: F200/190 (17 мм)
			- Збільшення: 3,5х
				- Діаметр поля спостереження: F300/290 (57 мм)
			- Збільшення: 5,4х
				- Діаметр поля спостереження: F300/290 (38 мм)`,
		},
		{
			id: 3,
			title: 'Дефібрилятор-монітор S6',
			price: 179580,
			category: 'Кардіологія',
			image: './images/products/s6.jpg',
			description: `Дефібріллятор-монітор S6 є комплексним рішенням для надання першої невідкладної допомоги на догоспітальному етапі, в тому числі в автомобілях швидкої допомоги, а також в умовах стаціонару. Гарантійний термін складає 24 місяці.
			Стандартна конфігурація включає:
			- Кольоровий дисплей розміром 7 дюймів.
			- Ручний режим дефібриляції.
			- Автоматичний режим АЗД (AED).
			- Режим кардіостимуляції.
			- Моніторинг параметрів: ЕКГ-5/3 відведень (ЧСС, аналіз ST сегменту, аналіз аритмій); частота дихання (RESP); насичення крові киснем (SpO2); частота пульсу (ЧП); НІАТ (систолічний, середній, діастолічний); СО2 (EtCO2, FiCO2, AWRR).
			- Термопринтер.
			Додатково до стандартної конфігурації можливість оснащення сумкою транспортувальною.
			Особливості включають:
			- Ручні режими дефібриляції (синхронна кардіоверсія та асинхронна дефібриляція).
			- Автоматична зовнішня дефібриляція (АЗД) з голосовими та текстовими підказками українською мовою.
			- Широкий вибір енергій від 1 до 360 Дж.
			- Багаторазові електроди для ручної дефібриляції (для дорослих та дітей).
			- Кардіостимуляція з двома режимами: ЕКС за вимогою та фіксована ЕКС.
			- Моніторинг фізіологічних параметрів через ЕКГ, RESP, SpO2, ЧП, НІАТ, СО2.
			- Вбудований трьохканальний термопринтер.
			- Акумуляторна батарея великої ємності з тривалістю автономної роботи від 6 годин до більш ніж 4.5 годин в залежності від режиму використання.
			- Система Анти-шок та протиударний корпус з гарантією безпечності в умовах високої продуктивності.
			- Сертифікація за стандартом EN1789 для використання в автомобілях швидкої допомоги.`,
			features: `Назва параметру: Дисплей монітора  
			Значення: 7-дюймовий, кольоровий дисплей, здатний відображати максимум 4 осцилограми.
			Назва параметру: Режим дефібриляції  
			Значення: Доступні режими ручної дефібриляції (асинхронний та синхронізований), а також автоматична зовнішня дефібриляція (АЗД).
			Назва параметру: Форма сигналу дефібриляції  
			Значення: Біфазний усічений експоненціальний розрядний імпульс.
			Назва параметру: Електроди для дефібриляції  
			Значення: Використовуються багаторазові та одноразові електроди для зовнішньої дефібриляції, призначені як для дорослих, так і для дітей.
			Назва параметру: Вибір енергії  
			Значення: Доступні значення енергії: 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 15, 20, 30, 50, 70, 100, 120, 150, 170, 200, 220, 250, 270, 300, 360 Дж.
			Назва параметру: Електрокардіостимуляція (ЕКС)  
			Значення: Реалізована фіксована ЕКС та ЕКС за вимогою.
			Назва параметру: Моніторинг ЕКГ (ECG)  
			Значення: Проводиться моніторинг і вимірювання параметрів ЕКГ через кабель ЕГК 3/5-відведень, багаторазові та одноразові електроди для дефібриляції.
			Назва параметру: Діапазон вимірювання ЧСС  
			Значення: 15-350 уд/хв.
			Назва параметру: Діапазон вимірювання частоти дихання (RESP)  
			Значення: 0-150 дих/хв.
			Назва параметру: Діапазон вимірювання SpO2  
			Значення: 0%~100%.
			Назва параметру: Діапазон вимірювання частоти пульсу (PR)  
			Значення: 20~250 уд/хв.
			Назва параметру: Вимірювання параметрів НІАТ (NIBP)  
			Значення: Вимірювання систолічного, діастолічного та середнього тиску.
			Назва параметру: Режим вимірювання НІАТ (NIBP)  
			Значення: Ручний, автоматичний та безперервний режими вимірювання НІАТ.
			Назва параметру: Параметри CO2  
			Значення: Діапазон вимірювання CO2: 0-150 мм рт. ст., 0-19,7%, 0-20 кПа; час прогріву менше 20 с; загальний час відгуку системи менше 3 с; швидкість відбору проб 50±10 мл/хв; діапазон вимірювання частоти дихання 2-150 дих/хв`,
		},
		{
			id: 4,
			title: 'Дефібрилятор-монітор S8',
			price: 227550,
			category: 'Кардіологія',
			image: './images/products/s8.jpg',
			description: `Особливості:
			Дефібриляція: ручні режими дефібриляції включають синхронну кардіоверсію та асинхронну дефібриляцію.
			Автоматична зовнішня дефібриляція (АЗД): застосовано запатентований алгоритм аналізу та автоматизований аналіз, в процесі дефібриляції та при наданні базової підтримки життєдіяльності виріб надає голосові та текстові повідомлення – підказки українською мовою.
			Широкий вибір енергій від 1 Дж до 360 Дж. Удосконалена технологія біфазного усіченого експоненційного розрядного імпульсу (Advanced Biphasic Truncated Exponential (BTE)) з автоматичною компенсацією вхідного імпедансу.
			Багаторазові електроди для ручної дефібриляції (для дорослих пацієнтів та дітей)
			Багатофункціональні одноразові електроди для дефібриляції в автоматичному режимі та кардіостимуляції (для дорослих пацієнтів) в стандартній комплектації.
			Кардіостимуляція: два режими черезшкірної неінвазивної кардіостимуляції режим ЕКС за вимогою та режим фіксованої ЕКС покращують швидкість відновлення пацієнта.
			Моніторинг фізіологічних показників: ЕКГ- 12/5/3/ відведень (ЧСС, аналіз ST сегменту, аналіз аритмій); частота дихання (RESP); насичення крові киснем (SpO2); індекс перфузії (ІР); частота пульсу (ЧП); Температура (по двом каналам); НІАТ (систолічний, середній, діастолічний); параметри інвазивного артеріального тиску по двом каналам (ART, PA, CVP, RAP, LAP, ICP, P1, P2, LV, Ao, UAP, BAP, FAP, UVP, IAP) для постійного моніторингу життєво важливих показників пацієнта.
			Роз’єм модуля СО2 (опційний моніторинг параметрів капнографії EtCO2, FiCO2, AWRR);
			Режим 12-ввідведень ЕКГ. Окрема кнопка на панелі управління для швидкого одночасного відображення на екрані 12 відведень ЕКГ в форматі 6×2.
			Пам’ять дефібрилятору розрахована на зберігання: даних трендів по всім параметрам за 160 годин, 2000 результатів вимірювань НІАТ, 200 подій тривоги по всім параметрам, до 10-ти хвилин огляду одноканальної хвилі, 1000 профілів, до 60 хвилин зберігання запису AED (АЗД) для кожного пацієнта (до 240 хвилин всіх записів AED (АЗД))
			Вбудований чотирьох канальний термопринтер.
			Акумуляторна батарея великої ємності забезпечує автономність використання: тривалість використання: в режимі моніторингу більше 6 годин; в режимі дефібриляції більше 210 розрядів (з максимальним рівнем енергії); в режимі кардіостимуляції більше 4,5 годин.
			Функції ручного та автоматичного самотестування при запуску дефібрилятора-монітора забезпечують готовність до застосування в разі нагальної потреби.
			Система Анти-шок та протиударний корпус із захистом від проникнення IP44 гарантує безпечне використання з високою продуктивність у найсуворіших умовах .
			S8 пройшов сертифікацію по стандарту EN1789, що дозволяє використовувати його для надання невідкладної допомоги в автомобілях швидкої допомоги та при перевезенні реанімаційних пацієнтів.
			Ергономічний дизайн, компактні розміри та незначна вага забезпечують зручність при перенесенні виробу.`,
			features: `Дисплей: 8.4-дюймовий, кольоровий, з можливістю відображення до 4-ох осцилограм в режимі моніторингу або 12-ти осцилограм в режимі 12 відведень ЕКГ.
			Режими дефібриляції:
			- Ручна дефібриляція (асинхронний режим)
			- Ручна дефібриляція (синхронізована кардіоверсія)
			- Автоматична зовнішня дефібриляція (АЗД)
			Форма сигналу дефібриляції: Біфазний усічений експоненціальний розрядний імпульс.
			Електроди для дефібриляції: Багаторазові для зовнішньої дефібриляції (дорослі та дитячі), одноразові для зовнішньої дефібриляції (дорослі).
			Вибір енергії: 1 / 2 / 3 / 4 / 5 / 6 / 7 / 8 / 9 / 10 / 15 / 20 / 30 / 50 / 70 / 100 / 120 / 150 / 170 / 200 / 220 / 250 / 270 / 300 / 360 Дж.
			Електрокардіостимуляція (ЕКС): Фіксована або за вимогою, з частотою стимуляції від 40 до 170 уд/хв та струмом стимуляції від 0 до 200 мА.
			Моніторинг ЕКГ (ECG): Доступний з кабелю 12/5/3-відведень, багаторазових та одноразових електродів для дефібриляції.
			Діапазон вимірювання:
			- ЧСС: 15-350 уд/хв
			- Частота дихання (RESP): 0-150 дих/хв
			- SpO2: 0-100%
			- Індекс перфузії (ІР): 0.05-20%
			- Частота пульсу (ЧП): 20-254 уд/хв (від датчика SpO2), 40-240 уд/хв (від датчика НІАТ), 20-350 уд/хв (від датчика ІАТ).
			Вимірювання параметрів НІАТ: Систолічний тиск, діастолічний тиск, середній тиск.
			Режим вимірювання НІАТ: Ручний, АВТО, Безперервний.
			Діапазон вимірювання температури (ТЕМП): 0-50°C, 2 канали.
			Вимірювання параметрів ІАТ (IBP): 2 канали зі значеннями ART, PA, CVP, RAP, LAP, ICP, P1, P2, LV, Ao, UAP, BAP, FAP, UVP, IAP та діапазоном вимірювання статичного тиску від -50 до +300 мм.рт.ст.`,
		},
		{
			id: 5,
			title: 'Пульсоксиметр ВP-10M',
			price: 1230,
			category: 'Кардіологія',
			image: './images/products/bp-10m.jpg',
			description: `Функція налаштування меж сигналів тривоги для SpO2 та частоти пульсу.
			Графічне відображення: плетизмограма, гістограма інтенсивності частоти пульсу.ДЕМО режим.
			Функція встановлення звукового сигналу частоти пульсу.
			6 режимів відображення в 4-х напрямках.
			Вимірювання можливе при мінімальному значенні індексу перфузії - 0.2%.
			Функція автоматичного вимкнення: якщо протягом 16 секунд прилад не отримує сигналів, він автоматично вимикається.
			Низьке енергоспоживання: може безперервно працювати 24 години від двох нових батарей типу AAA.
			Відображення на дисплеї попередження про низький заряд батарей.
			Незначна вага, малі розміри, шнурок для транспортування.
			Кольоровий OLED дисплей. Ерономічний дизайн.
			Зручний і простий в експлуатації.`,
			features: `Параметри дисплея: OLED, кольоровий, з 4 напрямками огляду.
			Діапазон вимірювань SpO2: від 35% до 100%, з дискретністю 1%, похибка (від 70% до 100%) 2%.
			Діапазон вимірювань частоти пульсу: від 25 уд/хв до 250 уд/хв, з дискретністю 1 уд/хв, похибка 2 уд/хв.
			Відображення інтенсивності частоти пульсу: у вигляді гістограми.
			Довжина хвилі світла, що випромінюється: червоне - 660 нм, інфрачервоне - 905 нм.
			Максимальна потужність випромінювання для інфрачервоного світла: 1.2 мВт.
			Параметри живлення: 3 В (з двома батареями ААА), 30 мА.
			Гарантія: 12 місяців.`,
		},
		{
			id: 6,
			title: 'Кишеньковий пульсоксиметр MD300K2',
			price: 8010,
			category: 'Кардіологія',
			image: './images/products/md300k2.jpg',
			description:
				'Кишеньковий пульсоксиметр MD300K2 призначений для безперервного контролю, вибіркової перевірки насичення кисню (SpO2), визначення частоти пульсу (PR) та PI (індексу перфузії) дорослої людини, підлітка, дитини чи немовля у лікарнях чи госпіталях.',
			features: `Екран 2.4” TFT відображає SPO2, пульс та хвильову пульсову діаграму.
			Діапазон вимірювання SPO2: 70-100%, точність 2%.
			Діапазон відображення SPO2: 0-100%.
			Роздільна здатність: 1%.
			Діапазон вимірювання пульсу: 30 ударів/хв. - 250 ударів/хв.
			Точність: 2 удари/хв чи 2%.
			Збереження та відтворення показників насичення киснем та частоти пульсу протягом 72 годин, інтервал часу - 4 секунди.
			Розміри: 143,3 мм (довжина) х 67,4 мм (ширина) х 36 мм (висота).
			Вага: менше 140 г + 10 г (без батарей).
			Гарантійний термін експлуатації 12 місяців з дня введення пристрою в експлуатацію при дотриманні споживачем умов експлуатації, транспортування та зберігання.`,
		},
		{
			id: 7,
			title: 'Електротерапевтичний прилад StimRehab² MT2200',
			price: 73390,
			category: 'Фізіотерапія',
			image: './images/products/mt2200.jpg',
			description: `Прилад електротерапії StimRehab2 MT2200
				Цей унікальний пристрій сприяє зменшенню болю, стимуляції м'язів, активізації клітинного метаболізму, розсмоктуванню гематом і випотів, а також застійних явищ на тканинах. Він містить велику кількість клінічних протоколів, які допоможуть вам дуже швидко підібрати правильне лікування. А його сенсорний екран забезпечує надзвичайно просте керування для користувача, щоб налаштувати будь-які параметри. StimRehab2 можна розширити вакуумним модулем, акумуляторним модулем і 2 каналами електротерапії, він портативний і делікатний завдяки інноваційному дизайну.`,
			features: `Параметри електротерапії:
			IF-4P (інтерференційний струм з чотириполюсною інтерференцією):
			Інтерференційний струм, що використовується в цьому режимі, представляє собою сигнали середньої частоти. Цей струм розподіляється через два канали, що включають чотири електроди. Потоки струму перетинаються один з одним в тілі в зоні, де потрібно проводити лікування. Два цих струми взаємно перешкоджають один одному в цій точці перетину, що модулює інтенсивність струму (інтенсивність збільшується і зменшується з регулярною частотою).
			- Вектор струму: Автоматичний: 20%-100%, крок 20%; ручний: 0°-90°, крок 15°
			- Режим випромінювання: Електроди
			- Несуча частота: 10 кГц, крок 0.5 кГц
			- Частота модулюючої напруги верхня (Beat H.): (Beat L.) - 200 Гц, крок 1 Гц
			- Частота модулюючої напруги нижня (Beat L.): 1 -(Beat H.) Гц крок 1 Гц
			- Вихідна інтенсивність: CC/ПC: 0-100 мA, крок 0.5 мA; CV/ПН: 0-100 В, крок 0.5 В
			- Тривалість сеансу терапії: 1-60 хвилин
			IF-2P (премодульований струм з двополюсною інтерференцією):
			Попередньо модульований струм, який використовується в цьому режимі, також є сигналами середньої частоти. У цьому випадку струм виходить лише з одного каналу, включаючи два електроди. Інтенсивність струму модулюється: вона збільшується і зменшується з регулярною частотою (частота модулювання амплітуди).
			- Несуча частота: 10 кГц, крок 0.5 кГц
			- Частота модулюючої напруги верхня (Beat H.): (Beat L.) - 200 Гц, крок 1 Гц
			- Частота модулюючої напруги нижня (Beat L.): 1 -(Beat H.) Гц крок 1 Гц
			- Вихідна інтенсивність: CC/ПC: 0-100 мA, крок 0.5 мA; CV/ПН: 0-100 В, крок 0.5 В
			- Режим каналу: Одноканальний режим, режими взаємного та узгодженого застосування
			- Тривалість сеансу терапії: 1-60 хвилин
			- Тривалість циклу: Безперервний, 10/10, 10/20, 10/30, 10/50, за вибором: 0-60
			- Час лінійного наростання: 0/0, 1/1, 2/2, 5/5, 8/8, за вибором: 0-9`,
		},
		{
			id: 8,
			title: 'Опромінювач ртутно-кварцовий ОКН-011М «Сонечко»',
			price: 5087,
			category: 'Фізіотерапія',
			image: './images/products/okh-011m.jpg',
			description: `Опромінювач ртутно-кварцовий ОКН-011М «Сонечко» призначений для місцевого опромінення (отримання еритеми на шкірі) і локального опромінення ЛОР - органів (вухо, горло, ніс) за допомогою тубусів, місцевого опромінення в ерітемной зоні. Також опромінювач використовується при лікуванні таких захворювань як: фурункул, гнійничкові захворювання шкіри, трофічні виразки, пролежні, запальні і посттравматичні захворювання суглобів, ревматичний артрит. Застосування тубусів дозволяє використовувати опромінювач при лікуванні гострих респіраторних захворювань піднебінних мигдалин, бронхіальної астми та інших хвороб всередині порожнинних і слизових оболонок тіла людини.
			Протипоказання: Злоякісні новоутворення, схильність до кровотеч, активний туберкульоз, виразкова хвороба шлунка та 12-палої кишки у стадії загострення, гіпертонічна хвороба 2-3 стадій, атеросклероз артерій головного мозку і коронарних судин.`,
			features: `Опроміненість в ефективному спектральному діапазоні:
			- При загальному опроміненні на відстані 0,7 м від опромінюваної поверхні: не менше 0,04 Вт/м²
			- При локальному опроміненні на зрізі тубуса ø5 мм: не менше 0,8 Вт/м²
			- При локальному опроміненні на зрізі тубуса ø15 мм: не менше 1,0 Вт/м²
			Напруга живлення: (220±22) В (50±0,5) Гц
			Ефективний спектральний діапазон випромінювань:
			- Для локальних випромінювань: 220 – 400 нм
			- Для загальних опромінень: 280 – 400 нм
			Споживана потужність від мережі: 260 ВА
			Габаритні розміри опромінювача: 230 х 140 х 170 мм
			Вага нетто: 1,4 кг
			Вага брутто: 1,6 кг
			Робочий час лампи ртутно-кварцової: не нормовано
			Стабілізація параметрів виробу відбувається протягом 5 хв після початку світіння ртутно-кварцової лампи
			Режим роботи: безперервна робота протягом 30 хв з наступною перервою не менше 15 хв.
			КОМПЛЕКТ ПОСТАВКИ:
			- Опромінювач в зібраному вигляді (без тубусів): 1 шт.
			- Тубус ø5 мм: 1 шт.
			- Тубус ø15 мм: 1 шт.
			- Керівництво по експлуатації: 1 екз.`,
		},
	],
}

const productsSlice = createSlice({
	name: 'products',
	initialState,
	reducers: {},
})

export default productsSlice.reducer
