import { createSlice } from '@reduxjs/toolkit'
import { Product } from '../../types' // Імпортуємо тип Product

interface ProductsState {
	items: Product[]
}

const initialState: ProductsState = {
	items: [
		{
			id: 1,
			title: 'Насос шприцевий М500',
			price: 46535,
			category: 'Хірургія',
			image: '/images/products/m500.jpg',
			description: `Екран: Шприцевий насос M500 оснащений великим 6,2-дюймовим кольоровим, сенсорним дисплеєм із можливістю регулювання кута нахилу екрану  від 0 до 45 градусів забезпечує зручність налаштувань та комфортну візуалізацію процесу інфузії.
			Двоканальна система: Двоканальна конструкція шприцевого насосу забезпечує не тільки режим одночасного введення двох різних лікарських препаратів з індивідуальними параметрами інфузії, а й режим каскадного введення одного і того ж лікарського препарату, який може забезпечити безперервну разову інфузію об’ємом до 120 мл.
			Режими інфузії: режим швидкості, режим часу, режим маси, режим інтервалу, режим TIVA, режим 1-ї дози, послідовний режим, мікро режим, режим Ramp, режим каскадної інфузії забезпечують готовність до інфузії в різноманітних клінічних ситуаціях.
			Самовизначення шприца: функція автоматичного визначення об’єму встановленого шприца (5 мл, 10 мл, 20 мл,30 мл, 50 або 60 мл).
			Бібліотека лікарських препаратів: нараховує 2100 лікарських препаратів, які розділено по типам, це дозволяє швидко вибирати потрібний препарат. Можливість редагування назв, додавання та видалення користувальницьких препаратів, присвоєння лікарському препарату відповідного типу забезпечує зручність в процесі експлуатації.
			Безперервне титрування: можливість редагування заданих параметрів в процесі інфузії без зупинки процесу введення лікарського препарату дозволяє медперсоналу швидко реагувати на клінічні зміни та налаштовувати параметри згідно потреб.
			Анти-болюс: функція автоматичного скидання тиску та моніторинг тиску в реальному часі. У разі виникнення оклюзії тиск в інфузійних трубках автоматично скидається та подається звуковий і візуальний сигнали тривоги, щоб медичний персонал звернув увагу і прийняв міри.
			Динамічний моніторинг тиску: сигналізація тривоги в режимі реального часу при виникненні аномального тиску, спеціально розроблена у відповідь на різкі зміни тиску в шприці. Величина тиску в шприці відстежується як за допомогою цифрового, так і та графічного дисплеїв.
			Багатопроцесорний моніторинг: конструкцією передбачено шість процесорів для моніторингу один одного та формування скоординованої системи сигналізації тривог, щоб забезпечити безпеку ін’єкції та запобігти нещасним випадкам.
			Високоточна ін'єкція: високопродуктивний кроковий двигун та система трансмісії забезпечують стабільну швидкість (без коливань) введення препарату з високою точністю і ефективністю, навіть на найнижчих значеннях швидкості інфузії.
			Мова інтерфейсного меню: українська, англійська російська.
			Пам'ять: журнал історії містить системні дані та дані виконаних інфузій, в пам’яті приладу може зберігатися 2000 записів.
			Графічні тренди: дані про динаміку змін за останні 12 годин
			Автономність роботи: за умови повністю зарядженого акумулятора та мінімальної яскравості насос може працювати на швидкості 5 мл/год не менше 5 годин. Насос може працювати за максимальної доступної для вибору швидкості з новою та повністю зарядженою батареєю протягом 1.5  години.
			Невідкладна медична допомога: можливість використання стаціонарно закріпленого М500 в машині швидкої допомоги під час транспортування пацієнтів.
			Ергономічний дизайн, компактні розміри, незначна вага, зручна ручка для перенесення забезпечують зручність в процесі експлуатації.
			Інше: самотестування при ввімкненні, режим очікування, функція виклику медсестри, нічний режим, дротове підключення до центральної станції моніторингу, підсвічування кнопок управління, функція план лікування для швидкого запуску інфузії з попередньо збереженими параметрами інфузії. Стандартна комплектація містить кронштейн для кріплення насоса.`,
			features: `Параметр: Двоканальний дисплей  
			Значення: 6.2-дюймовий, кольоровий, сенсорний, 800×480  
			Тип: Дисплей  
			
			Параметр: Шприци  
			Значення: 5мл, 10мл, 20мл, 30мл, 50мл, 60мл різних виробників  
			Тип: Шприц  
			
			Параметр: Режими інфузії  
			Значення: Режим швидкості, Режим часу, Режим маси, Режим інтервалу, Режим TIVA, Режим 1-ї дози, Послідовний режим, Мікро режим, Режим Ramp, Режим каскадної інфузії  
			Тип: Режими інфузії  
			
			Параметр: Діапазон налаштування швидкості  
			Значення: 0,10 мл/год~2200,00 мл/год;  
			Шприц 50/60 мл: 0,10-2200,00 мл/год;  
			Шприц 30 мл: 0,10-1200,00 мл/год;  
			Шприц 20 мл: 0,10-600,00 мл/год;  
			Шприц 10 мл: 0,10-300,00 мл/год;  
			Шприц 5 мл: 0,10-100,00 мл/год;  
			Тип: Діапазон налаштування швидкості  
			
			Параметр: Одиниці виміру швидкості  
			Значення: мл/год, г/год, мг/год, мкг/год, нг/год, г/кг/год, мг/кг/год, мкг/кг/год, нг/кг/год, г/кг/хв, мг/кг/хв, мкг/кг/хв, нг/кг/хв, ОД./кг/хв, ОД./кг/год, КО/кг/хв, КО/кг/год, МО/кг/хв, МО/кг/год  
			Тип: Одиниці виміру швидкості  
			
			Параметр: Діапазон налаштування дози  
			Значення: 0.000~999.999 (препарат), мінімальний крок налаштування 0.001  
			0.000~999.999 мл (рідина), мінімальний крок налаштування 0.01  
			Тип: Діапазон налаштування дози  
			
			Параметр: Одиниці маси дози  
			Значення: г, мг, мкг, нг, ОД, МО, KО  
			Тип: Одиниці маси дози  
			
			Параметр: Діапазон налаштування часу  
			Значення: 00:00:01～99:59:59 год:хв:с  
			Тип: Діапазон налаштування часу  
			
			Параметр: Діапазон налаштування об’єму VTBI  
			Значення: 0,10-9999,99 мл, 0 - вимк.  
			Мінімальний крок налаштування 0,01 мл  
			Тип: Діапазон налаштування об’єму VTBI  
			
			Параметр: Послідовний режим  
			Значення: Можна налаштувати до 10 послідовностей інфузії`,
		},
		{
			id: 2,
			title: 'Мікроскоп операційний офтальмологічний YZ20Р5',
			price: 243950,
			category: 'Хірургія',
			image: './images/products/yz20P5.jpg',
			description: `Операційний мікроскоп YZ20Р5
			(для проведення офтальмологічних втручань)
			
			Операційний пересувний мікроскоп YZ20P5 має невелику вагу, малі габарити, що робить його надзвичайно зручним. Він задовольняє всім вимогам загальної офтальмологічної мікрохірургії.
			
			Мікроскоп забезпечує стереоскопічний ефект, має три ступенями збільшення. В системі освітлення використовується джерело світла, яке є повністю безпечним для людського ока. Завдяки використанню високоякісних галогенних ламп, досягається яскраве і рівномірне освітлення.
			
			У кронштейнах використовується пружинна балансувальна система, яка дає можливість переміщувати мікроскоп у вертикальній площині і зупиняти його в потрібному положенні. Передбачена можливість точного фокусування. У мікроскопі можуть регулюватися такі параметри, як збільшення, фокусування, нахил, при цьому фокусування може регулюватися за допомогою педалі.
			
			особливості:
			- Пересувний, з трьома ступенями збільшення;
			- Пружинний балансувальний пристрій в кронштейні забезпечує вільне переміщення мікроскопа;
			- Все лінзи мають багатошарове покриття, захищені від цвілі.`,
			features: `Збільшення окуляра: 12,5X/16B

			Регульована оптична сила лінз в діоптріях: ±5D
			
			Нахил бінокулярного тубусу: 45°
			
			Діапазон регуляції міжзіничної відстані: 50 мм - 70 мм
			
			Джерело освітлення: Галогенна лампа 12 В / 100 Вт
			
			Тип освітлення: 6° +0° коаксиальне освітлення
			
			Коаксиалье освітлення: > 20000 люкс
			
			Максимальна довжина розкладеного кронштейна: 870 мм
			
			Регульований діапазон переміщення по вертикалі: 700 мм - 1100 мм
			
			Діапазон точного регулювання: 30 мм
			
			Параметри живлення: ~220 В /50 Гц
			
			Потужність: 120 ВА
			
			Запобіжник: ~250 В T 1,25 A
			
			Стандарт електричної безпеки: Стандарт IEC601-1
			
			Вага брутто, кг: 41
			
			Вага нетто, кг: 35
			
			Загальний обсяг упаковки: 0,2 м3
			
			Кількість коробок: 1
			
			Об'єктив / Робоча відстань:
			
			- Збільшення: 5,3х
				- Діаметр поля спостереження: F200/190 (38 мм)
				
			- Збільшення: 8х
				- Діаметр поля спостереження: F200/190 (25 мм)
				
			- Збільшення: 12х
				- Діаметр поля спостереження: F200/190 (17 мм)
			
			- Збільшення: 3,5х
				- Діаметр поля спостереження: F300/290 (57 мм)
			
			- Збільшення: 5,4х
				- Діаметр поля спостереження: F300/290 (38 мм)`,
		},
		{
			id: 3,
			title: 'Дефібрилятор-монітор S6',
			price: 179580,
			category: 'Кардіологія',
			image: './images/products/s6.jpg',
			description: '',
			features: '',
		},
		{
			id: 4,
			title: 'Дефібрилятор-монітор S8',
			price: 227550,
			category: 'Кардіологія',
			image: './images/products/s8.jpg',
			description: '',
			features: '',
		},
		{
			id: 5,
			title: 'Пульсоксиметр ВP-10M',
			price: 1230,
			category: 'Кардіологія',
			image: './images/products/bp-10m.jpg',
			description: `Функція налаштування меж сигналів тривоги для SpO2 та частоти пульсу.
			Графічне відображення: плетизмограма, гістограма інтенсивності частоти пульсу.ДЕМО режим.
			Функція встановлення звукового сигналу частоти пульсу.
			6 режимів відображення в 4-х напрямках.
			Вимірювання можливе при мінімальному значенні індексу перфузії - 0.2%.
			Функція автоматичного вимкнення: якщо протягом 16 секунд прилад не отримує сигналів, він автоматично вимикається.
			Низьке енергоспоживання: може безперервно працювати 24 години від двох нових батарей типу AAA.
			Відображення на дисплеї попередження про низький заряд батарей.
			Незначна вага, малі розміри, шнурок для транспортування.
			Кольоровий OLED дисплей. Ерономічний дизайн.
			Зручний і простий в експлуатації.`,
			features: `Параметри дисплея: OLED, кольоровий, з 4 напрямками огляду.

			Діапазон вимірювань SpO2: від 35% до 100%, з дискретністю 1%, похибка (від 70% до 100%) 2%.
			
			Діапазон вимірювань частоти пульсу: від 25 уд/хв до 250 уд/хв, з дискретністю 1 уд/хв, похибка 2 уд/хв.
			
			Відображення інтенсивності частоти пульсу: у вигляді гістограми.
			
			Довжина хвилі світла, що випромінюється: червоне - 660 нм, інфрачервоне - 905 нм.
			
			Максимальна потужність випромінювання для інфрачервоного світла: 1.2 мВт.
			
			Параметри живлення: 3 В (з двома батареями ААА), 30 мА.
			
			Гарантія: 12 місяців.`,
		},
		{
			id: 6,
			title: 'Кишеньковий пульсоксиметр MD300K2',
			price: 8010,
			category: 'Кардіологія',
			image: './images/products/md300k2.jpg',
			description:
				'Кишеньковий пульсоксиметр MD300K2 призначений для безперервного контролю, вибіркової перевірки насичення кисню (SpO2), визначення частоти пульсу (PR) та PI (індексу перфузії) дорослої людини, підлітка, дитини чи немовля у лікарнях чи госпіталях.',
			features: `Екран 2.4” TFT відображає SPO2, пульс та хвильову пульсову діаграму.
			Діапазон вимірювання SPO2: 70-100%, точність 2%.
			Діапазон відображення SPO2: 0-100%.
			Роздільна здатність: 1%.
			Діапазон вимірювання пульсу: 30 ударів/хв. - 250 ударів/хв.
			Точність: 2 удари/хв чи 2%.
			Збереження та відтворення показників насичення киснем та частоти пульсу протягом 72 годин, інтервал часу - 4 секунди.
			Розміри: 143,3 мм (довжина) х 67,4 мм (ширина) х 36 мм (висота).
			Вага: менше 140 г + 10 г (без батарей).
			Гарантійний термін експлуатації 12 місяців з дня введення пристрою в експлуатацію при дотриманні споживачем умов експлуатації, транспортування та зберігання.`,
		},
	],
}

const productsSlice = createSlice({
	name: 'products',
	initialState,
	reducers: {},
})

export default productsSlice.reducer
